#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.tenant["tenant1"].data.terraform_remote_state.platform: Reading...
module.tenant["tenant4"].data.terraform_remote_state.platform: Reading...
module.tenant["tenant4"].data.terraform_remote_state.platform: Read complete after 0s
module.tenant["tenant1"].data.terraform_remote_state.platform: Read complete after 0s
module.tenant["tenant1"].azurerm_resource_group.crgar-aca-dev-tenant-rg: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-tenant1-rg]
module.tenant["tenant4"].azurerm_resource_group.crgar-aca-dev-tenant-rg: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-tenant4-rg]
module.tenant["tenant4"].module.aca.azurerm_container_app_environment.crgar-aca-demo-tenant-env: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-tenant4-rg/providers/Microsoft.App/managedEnvironments/crgar-aca-dev-tenant4-aca-env]
module.tenant["tenant1"].module.aca.azurerm_container_app_environment.crgar-aca-demo-tenant-env: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-tenant1-rg/providers/Microsoft.App/managedEnvironments/crgar-aca-dev-tenant1-aca-env]
module.tenant["tenant1"].module.storage.azurerm_storage_account.crgar-aca-demo-tenant-storage: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-tenant1-rg/providers/Microsoft.Storage/storageAccounts/crgaracadevtenant1st]
module.tenant["tenant4"].module.storage.azurerm_storage_account.crgar-aca-demo-tenant-storage: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-tenant4-rg/providers/Microsoft.Storage/storageAccounts/crgaracadevtenant4st]
module.tenant["tenant1"].module.aca.azurerm_container_app.crgar-aca-demo-app: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-tenant1-rg/providers/Microsoft.App/containerApps/crgar-aca-dev-tenant1-aca-app]
module.tenant["tenant4"].module.aca.azurerm_container_app.crgar-aca-demo-app: Refreshing state... [id=/subscriptions/14506188-80f8-4dc6-9b28-250051fc4ee4/resourceGroups/crgar-aca-dev-tenant4-rg/providers/Microsoft.App/containerApps/crgar-aca-dev-tenant4-aca-app]
module.tenant["tenant4"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share: Refreshing state... [id=https://crgaracadevtenant4st.file.core.windows.net/mounted-share]
module.tenant["tenant1"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share: Refreshing state... [id=https://crgaracadevtenant1st.file.core.windows.net/mounted-share]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tenant["tenant1"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share2 will be created
  + resource "azurerm_storage_share" "crgar-aca-demo-tenant-storage-share2" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant1"
        }
      + name                 = "mounted-share2"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "crgaracadevtenant1st"
      + url                  = (known after apply)
    }

  # module.tenant["tenant4"].module.storage.azurerm_storage_share.crgar-aca-demo-tenant-storage-share2 will be created
  + resource "azurerm_storage_share" "crgar-aca-demo-tenant-storage-share2" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = {
          + "environment_name" = "dev"
          + "tenant_name"      = "tenant4"
        }
      + name                 = "mounted-share2"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "crgaracadevtenant4st"
      + url                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @crgarcia12, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Infrastructure Plan`*